<a href="https://colab.research.google.com/github/ljawuah/lja_pub/blob/main/04_Missing_Data.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

___

<a href='http://www.pieriandata.com'> <img src='../Pierian_Data_Logo.png' /></a>
___

# Missing Data

Let's show a few convenient methods to deal with Missing Data in pandas:

In [3]:
import numpy as np
import pandas as pd

In [6]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}#lj creating a dictionary...
df = pd.DataFrame(d)

In [5]:
#Alternativley, cast d directiry....
#df = pd.DataFrame({'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]})

In [7]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [10]:
df.dropna()#lj any row (axis = 0) with missing values are dropped

     A    B  C
0  1.0  5.0  1

In [12]:
df.dropna(axis=1)#lj any colunm(axis = 1) with missing values are dropped

   C
0  1
1  2
2  3

In [13]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [18]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [19]:
df.fillna(value='FILL VALUE')

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [22]:
df.fillna(value='*')#lj

   A  B  C
0  1  5  1
1  2  *  2
2  *  *  3

In [24]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [34]:
df['B'].fillna(value=df['B'].mean())

0    5.0
1    5.0
2    5.0
Name: B, dtype: float64

In [26]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [31]:
df['A'].fillna(value=1.4)
df['B'].fillna(value=4.8)

0    5.0
1    4.8
2    4.8
Name: B, dtype: float64

In [32]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

# Handling Missing Data in Pandas (LJ)

In [39]:
#Link: https://www.bmc.com/blogs/pandas-nan-missing-data/#
df = pd.DataFrame([np.arange(1,4)],index=['a','b','c'],
columns=["X","Y","Z"]) 
df

   X  Y  Z
a  1  2  3
b  1  2  3
c  1  2  3

In [47]:
#Now reindex this array adding an index d. Since d has no value it is filled with NaN.
new_index = ['a','b','c','d']
df1 = df.reindex(new_index) # keeping original df
df1

     X    Y    Z
a  1.0  2.0  3.0
b  1.0  2.0  3.0
c  1.0  2.0  3.0
d  NaN  NaN  NaN

In [49]:
pd.isna(df1) # Now use isna to check for missing values.

       X      Y      Z
a  False  False  False
b  False  False  False
c  False  False  False
d   True   True   True

In [50]:
pd.notna(df1) # The opposite check—looking for actual values—is notna().

       X      Y      Z
a   True   True   True
b   True   True   True
c   True   True   True
d  False  False  False

In [52]:
df['time'] = pd.Timestamp('20211225') # Note...NaT means a missing date.
df.loc['d'] = np.nan
df

     X    Y    Z       time
a  1.0  2.0  3.0 2021-12-25
b  1.0  2.0  3.0 2021-12-25
c  1.0  2.0  3.0 2021-12-25
d  NaN  NaN  NaN        NaT

In [54]:
df=df.fillna(1) #Here we can fill NaN values with the integer 1 using fillna(1)
df

     X    Y    Z                 time
a  1.0  2.0  3.0  2021-12-25 00:00:00
b  1.0  2.0  3.0  2021-12-25 00:00:00
c  1.0  2.0  3.0  2021-12-25 00:00:00
d  1.0  1.0  1.0                    1

In [56]:
#interpolate > Another feature of Pandas is that it will fill in missing values using what is logical.

arr=np.array([1,2,3])
idx=np.array([pd.Timestamp('20211225'),
pd.Timestamp('20211227'),
pd.Timestamp('20211229')])
df = pd.DataFrame(arr,index=idx)
idx=[pd.Timestamp('20211225'),
pd.Timestamp('20211226'),
pd.Timestamp('20211227'),
pd.Timestamp('20211228'),
pd.Timestamp('20211229')]
df=df.reindex(index=idx)
df

              0
2021-12-25  1.0
2021-12-26  NaN
2021-12-27  2.0
2021-12-28  NaN
2021-12-29  3.0

In [58]:
# Now we use the interpolate() function. Pandas fills them in nicely using the midpoints between the points. 
df=df.interpolate()
df

              0
2021-12-25  1.0
2021-12-26  1.5
2021-12-27  2.0
2021-12-28  2.5
2021-12-29  3.0

# Python Pandas Tutorial 6. Handle Missing Data: replace function

https://www.youtube.com/watch?v=XOxABiMhG2U

# Python Pandas Tutorial 5: Handle Missing Data: fillna, dropna, interpolate

https://www.youtube.com/watch?v=EaGbS7eWSs0

In [98]:

d = {'A':[1,2,1.5,np.nan,1],'B':[5,np.nan,3,np.nan,2],'C':[2.5,1,2,3,np.nan], 'D':[1.3,np.nan,2,4,-1]}#lj creating a dictionary...
df = pd.DataFrame(d)
df

     A    B    C    D
0  1.0  5.0  2.5  1.3
1  2.0  NaN  1.0  NaN
2  1.5  3.0  2.0  2.0
3  NaN  NaN  3.0  4.0
4  1.0  2.0  NaN -1.0

In [99]:
df_1 = df.replace([-1],np.NaN) # 
df_1

     A    B    C    D
0  1.0  5.0  2.5  1.3
1  2.0  NaN  1.0  NaN
2  1.5  3.0  2.0  2.0
3  NaN  NaN  3.0  4.0
4  1.0  2.0  NaN  NaN

In [100]:
#Creating a new column...
df['event'] = ['Rain', 'Sunny','snow','No Event','Rain']
df

     A    B    C    D     event
0  1.0  5.0  2.5  1.3      Rain
1  2.0  NaN  1.0  NaN     Sunny
2  1.5  3.0  2.0  2.0      snow
3  NaN  NaN  3.0  4.0  No Event
4  1.0  2.0  NaN -1.0      Rain

In [101]:
#Using dictionary form....
df_2 = df.replace({
    'A':1, 
    'C': 1,
    'event': 'No Event', 
    },np.NaN)
df_2

     A    B    C    D  event
0  NaN  5.0  2.5  1.3   Rain
1  2.0  NaN  NaN  NaN  Sunny
2  1.5  3.0  2.0  2.0   snow
3  NaN  NaN  3.0  4.0    NaN
4  NaN  2.0  NaN -1.0   Rain

In [103]:
#Using mapping form....
df_3 = df.replace({
    5: np.NaN,
    'No Event': 'No Rain'})
df_3

     A    B    C    D    event
0  1.0  NaN  2.5  1.3     Rain
1  2.0  NaN  1.0  NaN    Sunny
2  1.5  3.0  2.0  2.0     snow
3  NaN  NaN  3.0  4.0  No Rain
4  1.0  2.0  NaN -1.0     Rain

Replacing list with another list

In [104]:
df = pd.DataFrame({
    'score': ['exceptional','average', 'good', 'poor', 'average', 'exceptional'],
    'student': ['rob', 'maya', 'parthiv', 'tom', 'julian', 'erica']
})
df

         score  student
0  exceptional      rob
1      average     maya
2         good  parthiv
3         poor      tom
4      average   julian
5  exceptional    erica

In [105]:
df.replace(['poor', 'average', 'good', 'exceptional'], [1,2,3,4])# Replacing strings under score col

   score  student
0      4      rob
1      2     maya
2      3  parthiv
3      1      tom
4      2   julian
5      4    erica

Python Pandas Tutorial 5: Handle Missing Data: fillna, dropna, interpolate

https://www.youtube.com/watch?v=EaGbS7eWSs0

In [1]:
!wget https://github.com/codebasics/py/blob/master/pandas/5_handling_missing_data_fillna_dropna_interpolate/weather_data.csv

--2021-08-16 02:59:02--  https://github.com/codebasics/py/blob/master/pandas/5_handling_missing_data_fillna_dropna_interpolate/weather_data.csv
Resolving github.com (github.com)... 140.82.112.3
Connecting to github.com (github.com)|140.82.112.3|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: unspecified [text/html]
Saving to: ‘weather_data.csv’

weather_data.csv        [ <=>                ] 124.90K  --.-KB/s    in 0.007s

2021-08-16 02:59:02 (17.8 MB/s) - ‘weather_data.csv’ saved [127897]

In [26]:

#df = pd.read_csv('https://raw.githubusercontent.com/codebasics/py/master/pandas/5_handling_missing_data_fillna_dropna_interpolate/weather_data.csv')
#OR....
url = 'https://raw.githubusercontent.com/codebasics/py/master/pandas/5_handling_missing_data_fillna_dropna_interpolate/weather_data.csv'
df = pd.read_csv(url, parse_dates=['day'])

df

         day  temperature  windspeed   event
0 2017-01-01         32.0        6.0    Rain
1 2017-01-04          NaN        9.0   Sunny
2 2017-01-05         28.0        NaN    Snow
3 2017-01-06          NaN        7.0     NaN
4 2017-01-07         32.0        NaN    Rain
5 2017-01-08          NaN        NaN   Sunny
6 2017-01-09          NaN        NaN     NaN
7 2017-01-10         34.0        8.0  Cloudy
8 2017-01-11         40.0       12.0   Sunny

In [27]:
type(df.day[0]) # Use parse parse_dates=['day'] to conver string date to timestamp date

pandas._libs.tslibs.timestamps.Timestamp

In [28]:
df.set_index('day',inplace=True)
df

            temperature  windspeed   event
day
2017-01-01         32.0        6.0    Rain
2017-01-04          NaN        9.0   Sunny
2017-01-05         28.0        NaN    Snow
2017-01-06          NaN        7.0     NaN
2017-01-07         32.0        NaN    Rain
2017-01-08          NaN        NaN   Sunny
2017-01-09          NaN        NaN     NaN
2017-01-10         34.0        8.0  Cloudy
2017-01-11         40.0       12.0   Sunny

In [30]:

new_df = df.fillna(0)
new_df

            temperature  windspeed   event
day
2017-01-01         32.0        6.0    Rain
2017-01-04          0.0        9.0   Sunny
2017-01-05         28.0        0.0    Snow
2017-01-06          0.0        7.0       0
2017-01-07         32.0        0.0    Rain
2017-01-08          0.0        0.0   Sunny
2017-01-09          0.0        0.0       0
2017-01-10         34.0        8.0  Cloudy
2017-01-11         40.0       12.0   Sunny

In [31]:
new_df = df.fillna({
        'temperature': 0,
        'windspeed': 0,
        'event': 'No Event'
    }) # with mappiing...
new_df

            temperature  windspeed     event
day
2017-01-01         32.0        6.0      Rain
2017-01-04          0.0        9.0     Sunny
2017-01-05         28.0        0.0      Snow
2017-01-06          0.0        7.0  No Event
2017-01-07         32.0        0.0      Rain
2017-01-08          0.0        0.0     Sunny
2017-01-09          0.0        0.0  No Event
2017-01-10         34.0        8.0    Cloudy
2017-01-11         40.0       12.0     Sunny

In [32]:
new_df = df.fillna(method="ffill")
new_df

            temperature  windspeed   event
day
2017-01-01         32.0        6.0    Rain
2017-01-04         32.0        9.0   Sunny
2017-01-05         28.0        9.0    Snow
2017-01-06         28.0        7.0    Snow
2017-01-07         32.0        7.0    Rain
2017-01-08         32.0        7.0   Sunny
2017-01-09         32.0        7.0   Sunny
2017-01-10         34.0        8.0  Cloudy
2017-01-11         40.0       12.0   Sunny

In [33]:
new_df = df.fillna(method="bfill")
new_df

            temperature  windspeed   event
day
2017-01-01         32.0        6.0    Rain
2017-01-04         28.0        9.0   Sunny
2017-01-05         28.0        7.0    Snow
2017-01-06         32.0        7.0    Rain
2017-01-07         32.0        8.0    Rain
2017-01-08         34.0        8.0   Sunny
2017-01-09         34.0        8.0  Cloudy
2017-01-10         34.0        8.0  Cloudy
2017-01-11         40.0       12.0   Sunny

In [37]:
#new_df = df.fillna(method="bfill", axis="columns") # axis is either "index" or "columns"
new_df = df.fillna(method="bfill", axis=1) # axis is either "index" or "columns" | NOTE axis=1=> axis="columns"
new_df

           temperature windspeed   event
day
2017-01-01          32         6    Rain
2017-01-04           9         9   Sunny
2017-01-05          28      Snow    Snow
2017-01-06           7         7     NaN
2017-01-07          32      Rain    Rain
2017-01-08       Sunny     Sunny   Sunny
2017-01-09         NaN       NaN     NaN
2017-01-10          34         8  Cloudy
2017-01-11          40        12   Sunny

In [44]:
new_df = df.fillna(method="ffill",limit=1)
new_df

            temperature  windspeed   event
day
2017-01-01         32.0        6.0    Rain
2017-01-04         32.0        9.0   Sunny
2017-01-05         28.0        9.0    Snow
2017-01-06         28.0        7.0    Snow
2017-01-07         32.0        7.0    Rain
2017-01-08         32.0        NaN   Sunny
2017-01-09          NaN        NaN   Sunny
2017-01-10         34.0        8.0  Cloudy
2017-01-11         40.0       12.0   Sunny

In [45]:
new_df = df.interpolate()
new_df

            temperature  windspeed   event
day
2017-01-01    32.000000       6.00    Rain
2017-01-04    30.000000       9.00   Sunny
2017-01-05    28.000000       8.00    Snow
2017-01-06    30.000000       7.00     NaN
2017-01-07    32.000000       7.25    Rain
2017-01-08    32.666667       7.50   Sunny
2017-01-09    33.333333       7.75     NaN
2017-01-10    34.000000       8.00  Cloudy
2017-01-11    40.000000      12.00   Sunny

In [47]:

new_df = df.interpolate(method='time')
new_df

            temperature  windspeed   event
day
2017-01-01    32.000000       6.00    Rain
2017-01-04    29.000000       9.00   Sunny
2017-01-05    28.000000       8.00    Snow
2017-01-06    30.000000       7.00     NaN
2017-01-07    32.000000       7.25    Rain
2017-01-08    32.666667       7.50   Sunny
2017-01-09    33.333333       7.75     NaN
2017-01-10    34.000000       8.00  Cloudy
2017-01-11    40.000000      12.00   Sunny

In [49]:
new_df = df.dropna(how='all')
new_df

            temperature  windspeed   event
day
2017-01-01         32.0        6.0    Rain
2017-01-04          NaN        9.0   Sunny
2017-01-05         28.0        NaN    Snow
2017-01-06          NaN        7.0     NaN
2017-01-07         32.0        NaN    Rain
2017-01-08          NaN        NaN   Sunny
2017-01-10         34.0        8.0  Cloudy
2017-01-11         40.0       12.0   Sunny

In [55]:
new_df = df.dropna(thresh=3)
new_df

            temperature  windspeed   event
day
2017-01-01         32.0        6.0    Rain
2017-01-10         34.0        8.0  Cloudy
2017-01-11         40.0       12.0   Sunny

In [51]:
df

            temperature  windspeed   event
day
2017-01-01         32.0        6.0    Rain
2017-01-04          NaN        9.0   Sunny
2017-01-05         28.0        NaN    Snow
2017-01-06          NaN        7.0     NaN
2017-01-07         32.0        NaN    Rain
2017-01-08          NaN        NaN   Sunny
2017-01-09          NaN        NaN     NaN
2017-01-10         34.0        8.0  Cloudy
2017-01-11         40.0       12.0   Sunny

# Great Job!